foamfiles/counterFlowFlame2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    fuel
    {
        type            patch;
        nFaces          0;
        startFace       5;
    }
    primary_air
    {
        type            patch;
        nFaces          0;
        startFace       5;
    }
    secondary_air_RHS
    {
        type            patch;
        nFaces          0;
        startFace       5;
    }
    secondary_air_LHS
    {
        type            patch;
        nFaces          0;
        startFace       5;
    }
    outlet
    {
        type            patch;
        nFaces          0;
        startFace       5;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       5;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          44;
        startFace       5;
    }
)

// ************************************************************************* //
