foamfiles/counterFlowFlame2D/constant/reactions_adapted.txt
// Needs edits

species
(
    O2
    H2O
    CO
    CO2
    N2
    H2
);

reactions
{
    methaneReaction
    {
        type     irreversibleArrheniusReaction;
        reaction "CH4 + 2O2 = CO2 + 2H2O";
        A        5.2e16;
        beta     0;
        Ta       14906;

    }
}
